Revit 2024 API
AdaptivePointType Enumeration
 An enumerated type containing possible types for Adaptive Points.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public enum AdaptivePointType
Visual Basic
Public Enumeration AdaptivePointType
Visual C++
public enum class AdaptivePointType
Members
Member name | Description
ReferencePoint |  Reference Point.
PlacementPoint |  Placement Point.
ShapeHandlePoint |  Shape Handle Point.
See Also
Autodesk.Revit.DB Namespace